Олимпиада/src/Catalogs/ВопросыКОлимпиаде/ВопросыКОлимпиаде.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыКОлимпиаде</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КодНаВстроенномЯзыке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корректный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Открытый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Олимпиада/src/Catalogs/ВопросыКОлимпиаде/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВариантыОтветовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.Корректный = Ложь;
		Элемент.ТекущиеДанные.Открытый = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтветовКорректныйПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВариантыОтветов.ТекущиеДанные;
	Для Каждого ВариантОтвета Из Объект.ВариантыОтветов Цикл
		Если ВариантОтвета.Корректный И ВариантОтвета <> ТекущаяСтрока Тогда
			ВариантОтвета.Корректный = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтветовОткрытыйПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВариантыОтветов.ТекущиеДанные;
	Для Каждого ВариантОтвета Из Объект.ВариантыОтветов Цикл
		Если ВариантОтвета.Открытый И ВариантОтвета <> ТекущаяСтрока Тогда
			ВариантОтвета.Открытый = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
